RzNmKX/gpsdo-fw/lib/stm32h5/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define GPS_EXT_TX_Pin GPIO_PIN_2
#define GPS_EXT_TX_GPIO_Port GPIOA
#define GPS_EXT_RX_Pin GPIO_PIN_3
#define GPS_EXT_RX_GPIO_Port GPIOA
#define ROTARY_PRESS_Pin GPIO_PIN_5
#define ROTARY_PRESS_GPIO_Port GPIOA
#define ROTARY_PRESS_EXTI_IRQn EXTI5_IRQn
#define ROTARY_A_Pin GPIO_PIN_6
#define ROTARY_A_GPIO_Port GPIOA
#define ROTARY_B_Pin GPIO_PIN_7
#define ROTARY_B_GPIO_Port GPIOA
#define GPS_TX_Pin GPIO_PIN_10
#define GPS_TX_GPIO_Port GPIOB
#define GPS_RX_Pin GPIO_PIN_12
#define GPS_RX_GPIO_Port GPIOA
#define LED1_Pin GPIO_PIN_13
#define LED1_GPIO_Port GPIOC
#define PPS_Pin GPIO_PIN_8
#define PPS_GPIO_Port GPIOA
#define PPS_OUTPUT_Pin GPIO_PIN_1
#define PPS_OUTPUT_GPIO_Port GPIOB
#define GPS_LOCK_OUTPUT_Pin GPIO_PIN_0
#define GPS_LOCK_OUTPUT_GPIO_Port GPIOA
#define PPB_LOCK_OUTPUT_Pin GPIO_PIN_1
#define PPB_LOCK_OUTPUT_GPIO_Port GPIOA
#define VCO_CONTROL_Pin GPIO_PIN_9
#define VCO_CONTROL_GPIO_Port GPIOA
#define LCD_CONTRAST_Pin GPIO_PIN_10
#define LCD_CONTRAST_GPIO_Port GPIOA
#define LCD_RW_Pin GPIO_PIN_3
#define LCD_RW_GPIO_Port GPIOB
#define LCD_D4_Pin GPIO_PIN_4
#define LCD_D4_GPIO_Port GPIOB
#define LCD_D5_Pin GPIO_PIN_5
#define LCD_D5_GPIO_Port GPIOB
#define LCD_D6_Pin GPIO_PIN_6
#define LCD_D6_GPIO_Port GPIOB
#define LCD_D7_Pin GPIO_PIN_7
#define LCD_D7_GPIO_Port GPIOB
#define LCD_EN_Pin GPIO_PIN_8
#define LCD_EN_GPIO_Port GPIOB
#define LCD_RS_Pin GPIO_PIN_15
#define LCD_RS_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
